Revit 2027 API
UIDocument Properties
The UIDocument type exposes the following members.
Properties
Name | Description
ActiveGraphicalView |  The currently active graphical view of the currently active document.
ActiveView |  The currently active view of the currently active document.
Application |  Retrieves an object that represents the current Application.
Document | Returns the database level document represented by this UI-level document.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Selection | Retrieve the currently selected Elements in Autodesk Revit.
Top
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace